InformationRegisters/ЖурналОтчетовСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналОтчетовСтатусы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтролирующегоОргана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтролирующихОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонтролирующегоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>Корректировочный номер (0 - Первичный).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПериод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСдачиОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСдачиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправляетсяВКонтролирующийОрган</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКонтролирующегоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКритическиеОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Непрочтенное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтраницыЖурналаОтчетность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтраницыЖурналаОтчетность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕГРЮЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервисы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыИПособия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЖурналОтчетовСтатусы/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
		Запись = Новый Структура;
		Запись.Вставить("Объект", ЗаписьРегистра.Ссылка);
		Запись.Вставить("Организация", ЗаписьРегистра.Организация);
		Запись.Вставить("Страница", Перечисления.СтраницыЖурналаОтчетность.Отчеты);
		Запись.Вставить("КонтролирующийОрган", ЗаписьРегистра.ПредставлениеКонтролирующегоОргана);
		Запись.Вставить("Состояние", ЗаписьРегистра.СостояниеСдачиОтчетности);
		Запись.Вставить("Статус", ЗаписьРегистра.Статус);
		Запись.Вставить("Наименование", ЗаписьРегистра.НаименованиеОтчета);
		Запись.Вставить("НеОтправляетсяВКонтролирующийОрган", ЗаписьРегистра.НеОтправляетсяВКонтролирующийОрган);
		Запись.Вставить("ЕстьОтвет", Ложь);
		Запись.Вставить("ВидКонтролирующегоОргана", ЗаписьРегистра.ВидКонтролирующегоОргана);
		Запись.Вставить("ЕстьКритическиеОшибкиОтправки", ЗаписьРегистра.ЕстьКритическиеОшибкиОтправки);
		Запись.Вставить("Просмотрено", Не ЗаписьРегистра.Непрочтенное);
		Запись.Вставить("Скрыт", ЗаписьРегистра.Скрыт);
		Запись.Вставить("ДатаНачала", ЗаписьРегистра.ДатаНачала);
		Запись.Вставить("ДатаОкончания", ЗаписьРегистра.ДатаОкончания);
		Запись.Вставить("ВидДокумента", Перечисления.ВидыДокументовВЖурнале.ПустаяСсылка());
		
		Если ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(ЗаписьРегистра.Организация) Тогда
		
			ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаписатьСобытиеДокументооборотаСКО(Запись);
			
		КонецЕсли;
		
		Если ИнтерфейсыВзаимодействияБРО.ДопускаетсяРучнойСтатус(ЗаписьРегистра.Ссылка, ЗаписьРегистра.Статус, ЗаписьРегистра.СостояниеСдачиОтчетности) Тогда
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.ПриИзмененииРучногоСтатуса(ЗаписьРегистра.Ссылка, ЗаписьРегистра.Статус);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
